Practicas/PracticasGretl/Lecc03.org
#+title:  Lección 3
#+author: Marcos Bujosa
#+STARTUP: show4levels
#+LANGUAGE: es-es

#+EXPORT_FILE_NAME: pub/Lecc03

# +OPTIONS: toc:nil
#+OPTIONS: tags:nil

#+LATEX_CLASS: article

#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}
#+LaTeX_HEADER: \usepackage[svgnames,x11names]{xcolor}
#+LaTeX_HEADER: \hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
#+LaTeX_HEADER: \PassOptionsToPackage{hyphens}{url}
# +LaTeX_HEADER: \input{notacionLinAlg.tex}
#+LaTeX_HEADER: \usepackage{nacal}

#+LaTeX_HEADER: \usepackage{framed}

#+LaTeX_HEADER: \usepackage{listings}
#+LaTeX_HEADER: \input{hansl.tex}
#+LaTeX_HEADER: \lstnewenvironment{hansl-gretl}
#+LaTeX_HEADER: {\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
#+LaTeX_HEADER: {}
#+LaTeX_HEADER: \newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{white},basicstyle=\ttfamily\footnotesize,breaklines=true, captionpos=b,commentstyle=\color{mygreen},escapeinside={\%*}{*)}, keywordstyle=\color{blue},stringstyle=\color{mymauve}, }
# +LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20},basicstyle=\ttfamily\footnotesize,breaklines=true, }
#+LaTeX_HEADER: \lstset{backgroundcolor=\color{lightgray!20}, }

#+name: setup-listings
#+begin_src emacs-lisp :exports none :results silent
  (setq org-latex-listings 'listings)
  (setq org-latex-custom-lang-environments
  	;'((emacs-lisp "common-lispcode")))
  	'((emacs-lisp "hansl-gretl")))
  (setq org-latex-listings-options
	'(("frame" "lines")
	  ("basicstyle" "\\scriptsize")
	  ("basicstyle" "\\ttfamily")
	  ("numbers=none" "left")
	  ("backgroundcolor=\\color{lightgray!20}")
	  ("numberstyle" "\\tiny")))
  (setq org-latex-to-pdf-process
	'("pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"
	"pdflatex -interaction nonstopmode -output-directory %o %f"))
  (org-add-link-type
   "latex" nil
   (lambda (path desc format)
     (cond
      ((eq format 'html)
       (format "<span class=\"%s\">%s</span>" path desc))
      ((eq format 'latex)
       (format "\\%s{%s}" path desc)))))
#+end_src

# \lstnewenvironment{code}
#     {\lstset{language=haskell,
#     basicstyle=\small\ttfamily,
#     numbers=left,
#     numberstyle=\tiny\color{gray},
#     backgroundcolor=\color{lightgray},
#     firstnumber=auto
#     }}
#     {}

#+bibliography: ref.bib

# +latex: \clearpage

#+LATEX: \clearpage

* Datos de Anscombe
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/anscombe.inp
   :END:

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/anscombe.inp][anscombe.inp]] |

En esta práctica con [[https://gretl.sourceforge.net/es.html][Gretl]] trabajaremos con los [[http://en.wikipedia.org/wiki/Anscombe's_quartet][datos]] diseñados por
F.J. Anscombe para ilustrar la importancia de /ver/ los diagramas de
dispersión entre distintas variables antes de realizar ninguna
regresión y así identificar deficiencias en el planteamiento de los
modelo, pues si únicamente se analizan los resultados numéricos de las
estimaciones dichas deficiencias quedan ocultas.

** La importancia de /ver/ los datos
**** Objetivo
Cuando se ajusta un modelo a los datos, es NECESARIO comenzar
observando gráficamente los datos. F.J. Anscombe diseñó este
[[http://en.wikipedia.org/wiki/Anscombe's_quartet][conjunto de datos]]
para ilustrar la importancia de representar gráficamente los datos
antes de realizar un análisis empírico.

** Los datos

| \Vect[1]{y} | \Vect[2]{y} | \Vect[3]{y} | \Vect[4]{y} | \Vect{x} | \Vect[4]{x} |
|-------------+-------------+-------------+-------------+----------+-------------|
|        8.04 |        9.14 |        7.46 |        6.58 |       10 |           8 |
|        6.95 |        8.14 |        6.77 |        5.76 |        8 |           8 |
|        7.58 |        8.74 |       12.74 |        7.71 |       13 |           8 |
|        8.81 |        8.77 |        7.11 |        8.84 |        9 |           8 |
|        8.33 |        9.26 |        7.81 |        8.47 |       11 |           8 |
|        9.96 |        8.10 |        8.84 |        7.04 |       14 |           8 |
|        7.24 |        6.13 |        6.08 |        5.25 |        6 |           8 |
|        4.26 |        3.10 |        5.39 |       12.50 |        4 |          19 |
|       10.84 |        9.13 |        8.15 |        5.56 |       12 |           8 |
|        4.82 |        7.26 |        6.42 |        7.91 |        7 |           8 |
|        5.68 |        4.74 |        5.73 |        6.89 |        5 |           8 |
|-------------+-------------+-------------+-------------+----------+-------------|

** Los estadísticos de los datos


|------------------------------------------------------------------------+-------|
| Estadísticos de los datos                                              |       |
|------------------------------------------------------------------------+-------|
| Media de cada una de las variables \Vect{x}:                           |   9.0 |
| Varianza de cada una de las variables \Vect{x}:                        |  11.0 |
| Media de cada una de las variables \Vect{y}:                           |   7.5 |
| Varianza de cada una de las variables \Vect{y}:                        |  4.12 |
| Correlación entre las variables \Vect{x} e \Vect{y} de cada regresión: | 0.816 |
|------------------------------------------------------------------------+-------|

|--------------------------------------------------------+------|
| Rectas de regresión                                    |  R^2 |
|--------------------------------------------------------+------|
| $\VEstmc[1]{y} = 3\cdot\Vect{1} + 0.5\cdot\Vect{x}$    | 0.67 |
| $\VEstmc[2]{y} = 3\cdot\Vect{1} + 0.5\cdot\Vect{x}$    | 0.67 |
| $\VEstmc[3]{y} = 3\cdot\Vect{1} + 0.5\cdot\Vect{x}$    | 0.67 |
| $\VEstmc[4]{y} = 3\cdot\Vect{1} + 0.5\cdot\Vect[4]{x}$ | 0.67 |
|--------------------------------------------------------+------|

** Actividad 1 - Estadísticos descriptivos

***** Carga de datos
*/~Archivo --> Abrir datos --> Archivo de muestra~/* y en la pestaña
*/~Gretl~/* seleccione =anscombe=.

#+latex: {\vspace{3pt} \color{gray!70!black}
/o bien teclee en linea de comandos/:
  #+NAME: DA-carga-datos
  #+begin_src hansl
open anscombe
  #+end_src  
#+latex: }

#+BEAMER:  \vspace{-8pt}

***** Visualice los estadísticos descriptivos de las datos

- Marque una variable (o varias) y ``Pinche'' con el botón derecho.
  Elija */~Estadísticos principales~/*
  
  #+latex: {\vspace{3pt} \color{gray!70!black}
  /o bien teclee en linea de comandos/ =summary= seguido de las series. Por ejemplo:
    #+NAME: DA-estadisticos-simples
    #+begin_src hansl
summary --simple y1 y2 y3 y4 x x4
    #+end_src
  #+latex: }

#+BEAMER:  \vspace{-8pt}
  
***** Observar la correlación entre variables
  
- */~Ver --> Matriz de correlación~/* y elija variables

  #+latex: {\vspace{3pt} \color{gray!70!black}
  /o, por ejemplo, teclee en linea de comandos/:
    #+NAME: DA-correlaciones
    #+begin_src hansl
corr y1 y2 y3 y4 x x4
    #+end_src
  #+latex: }

** Actividad 2 - Cuatro regresiones

Realice los siguientes cuatro ajustes MCO
- Modelo 1: $\quad \VEstmc[1]{y} = \Estmc{a}\Vect{1} + \Estmc{b}\Vect{x}$ 
- Modelo 2: $\quad \VEstmc[2]{y} = \Estmc{a}\Vect{1} + \Estmc{b}\Vect{x}$ 
- Modelo 3: $\quad \VEstmc[3]{y} = \Estmc{a}\Vect{1} + \Estmc{b}\Vect{x}$ 
- Modelo 4: $\quad \VEstmc[4]{y} = \Estmc{a}\Vect{1} + \Estmc{b}\Vect[4]{x}$
   
y compare los resultados.

- Para cada modelo:

  */~Modelo -> Mínimos Cuadrados Ordinarios~/*; indique regresando y
  regresores. Pulse */~Aceptar~/* (guarde el modelo como icono).
  
  #+latex: {\vspace{3pt} \color{gray!70!black}
  /o bien teclee en linea de comandos/:
    #+NAME: DA-regresiones
    #+begin_src hansl
Modelo1 <- ols y1 0 x
Modelo2 <- ols y2 0 x
Modelo3 <- ols y3 0 x
Modelo4 <- ols y4 0 x4
    #+end_src
  #+latex: }
      
** Actividad 3 - Discusión

***** Compare los estadísticos de los distintos modelos
- el coeficiente de determinación y en el coeficiente de determinación ajustado 
- la suma de cuadrados de los residuos,
- la desviación típica de los errores de ajuste (~D.T. de la regresión~),
- los estadísticos \testadistico
- los p-valores.

***** A la luz de los estadísticos de las cuatro regresiones ¿Qué modelo es mejor?
      
