Practicas/PracticasGretl/pub/Lecc03.tex
% Created 2023-11-02 jue 20:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish, ]{babel}
\usepackage[margin=0.5in]{geometry}
\usepackage[svgnames,x11names]{xcolor}
\hypersetup{linktoc = all, colorlinks = true, urlcolor = DodgerBlue4, citecolor = PaleGreen1, linkcolor = SpringGreen4}
\PassOptionsToPackage{hyphens}{url}
\usepackage{nacal}
\usepackage{framed}
\usepackage{listings}
\input{hansl.tex}
\lstnewenvironment{hansl-gretl}
{\lstset{language={hansl},basicstyle={\ttfamily\footnotesize},numbers,rame=single,breaklines=true}}
{}
\newcommand{\hansl}[1]{\lstset{language={hansl},basicstyle={\ttfamily\small}}\lstinline{#1}}
\lstset{backgroundcolor=\color{lightgray!20}, }
\author{Marcos Bujosa}
\date{\today}
\title{Lección 3}
\begin{document}

\maketitle
\tableofcontents

\clearpage

\section{Datos de Anscombe}
\label{sec:orgcc3c40f}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/anscombe.inp}{anscombe.inp}\\[0pt]
\end{tabular}
\end{center}

En esta práctica con \href{https://gretl.sourceforge.net/es.html}{Gretl} trabajaremos con los \href{http://en.wikipedia.org/wiki/Anscombe's\_quartet}{datos} diseñados por
F.J. Anscombe para ilustrar la importancia de \emph{ver} los diagramas de
dispersión entre distintas variables antes de realizar ninguna
regresión y así identificar deficiencias en el planteamiento de los
modelo, pues si únicamente se analizan los resultados numéricos de las
estimaciones dichas deficiencias quedan ocultas.

\subsection{La importancia de \emph{ver} los datos}
\label{sec:orgca59e93}
\begin{enumerate}
\item Objetivo
\label{sec:orgfde63c1}
Cuando se ajusta un modelo a los datos, es NECESARIO comenzar
observando gráficamente los datos. F.J. Anscombe diseñó este
\href{http://en.wikipedia.org/wiki/Anscombe's\_quartet}{conjunto de datos}
para ilustrar la importancia de representar gráficamente los datos
antes de realizar un análisis empírico.
\end{enumerate}

\subsection{Los datos}
\label{sec:org4d4cad3}

\begin{center}
\begin{tabular}{rrrrrr}
\Vect[1]{y} & \Vect[2]{y} & \Vect[3]{y} & \Vect[4]{y} & \Vect{x} & \Vect[4]{x}\\[0pt]
\hline
8.04 & 9.14 & 7.46 & 6.58 & 10 & 8\\[0pt]
6.95 & 8.14 & 6.77 & 5.76 & 8 & 8\\[0pt]
7.58 & 8.74 & 12.74 & 7.71 & 13 & 8\\[0pt]
8.81 & 8.77 & 7.11 & 8.84 & 9 & 8\\[0pt]
8.33 & 9.26 & 7.81 & 8.47 & 11 & 8\\[0pt]
9.96 & 8.10 & 8.84 & 7.04 & 14 & 8\\[0pt]
7.24 & 6.13 & 6.08 & 5.25 & 6 & 8\\[0pt]
4.26 & 3.10 & 5.39 & 12.50 & 4 & 19\\[0pt]
10.84 & 9.13 & 8.15 & 5.56 & 12 & 8\\[0pt]
4.82 & 7.26 & 6.42 & 7.91 & 7 & 8\\[0pt]
5.68 & 4.74 & 5.73 & 6.89 & 5 & 8\\[0pt]
\hline
\end{tabular}
\end{center}

\subsection{Los estadísticos de los datos}
\label{sec:org9e38432}


\begin{center}
\begin{tabular}{lr}
\hline
Estadísticos de los datos & \\[0pt]
\hline
Media de cada una de las variables \Vect{x}: & 9.0\\[0pt]
Varianza de cada una de las variables \Vect{x}: & 11.0\\[0pt]
Media de cada una de las variables \Vect{y}: & 7.5\\[0pt]
Varianza de cada una de las variables \Vect{y}: & 4.12\\[0pt]
Correlación entre las variables \Vect{x} e \Vect{y} de cada regresión: & 0.816\\[0pt]
\hline
\end{tabular}
\end{center}

\begin{center}
\begin{tabular}{lr}
\hline
Rectas de regresión & R\textsuperscript{2}\\[0pt]
\hline
\(\VEstmc[1]{y} = 3\cdot\Vect{1} + 0.5\cdot\Vect{x}\) & 0.67\\[0pt]
\(\VEstmc[2]{y} = 3\cdot\Vect{1} + 0.5\cdot\Vect{x}\) & 0.67\\[0pt]
\(\VEstmc[3]{y} = 3\cdot\Vect{1} + 0.5\cdot\Vect{x}\) & 0.67\\[0pt]
\(\VEstmc[4]{y} = 3\cdot\Vect{1} + 0.5\cdot\Vect[4]{x}\) & 0.67\\[0pt]
\hline
\end{tabular}
\end{center}

\subsection{Actividad 1 - Estadísticos descriptivos}
\label{sec:org6b87beb}

\begin{enumerate}
\item Carga de datos
\label{sec:org4f8bde7}
\textbf{\emph{\texttt{Archivo -{}-> Abrir datos -{}-> Archivo de muestra}}} y en la pestaña
\textbf{\emph{\texttt{Gretl}}} seleccione \texttt{anscombe}.

{\vspace{3pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
open anscombe
\end{verbatim}
}

\item Visualice los estadísticos descriptivos de las datos
\label{sec:orgfa5bd91}

\begin{itemize}
\item Marque una variable (o varias) y ``Pinche'' con el botón derecho.
Elija \textbf{\emph{\texttt{Estadísticos principales}}}

{\vspace{3pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos} \texttt{summary} seguido de las series. Por ejemplo:
\begin{verbatim}
summary --simple y1 y2 y3 y4 x x4
\end{verbatim}
}
\end{itemize}

\item Observar la correlación entre variables
\label{sec:org1149a6f}

\begin{itemize}
\item \textbf{\emph{\texttt{Ver -{}-> Matriz de correlación}}} y elija variables

{\vspace{3pt} \color{gray!70!black}
\emph{o, por ejemplo, teclee en linea de comandos}:
\begin{verbatim}
corr y1 y2 y3 y4 x x4
\end{verbatim}
}
\end{itemize}
\end{enumerate}

\subsection{Actividad 2 - Cuatro regresiones}
\label{sec:orgd632461}

Realice los siguientes cuatro ajustes MCO
\begin{itemize}
\item Modelo 1: \(\quad \VEstmc[1]{y} = \Estmc{a}\Vect{1} + \Estmc{b}\Vect{x}\)
\item Modelo 2: \(\quad \VEstmc[2]{y} = \Estmc{a}\Vect{1} + \Estmc{b}\Vect{x}\)
\item Modelo 3: \(\quad \VEstmc[3]{y} = \Estmc{a}\Vect{1} + \Estmc{b}\Vect{x}\)
\item Modelo 4: \(\quad \VEstmc[4]{y} = \Estmc{a}\Vect{1} + \Estmc{b}\Vect[4]{x}\)
\end{itemize}

y compare los resultados.

\begin{itemize}
\item Para cada modelo:

\textbf{\emph{\texttt{Modelo -> Mínimos Cuadrados Ordinarios}}}; indique regresando y
regresores. Pulse \textbf{\emph{\texttt{Aceptar}}} (guarde el modelo como icono).

{\vspace{3pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
Modelo1 <- ols y1 0 x
Modelo2 <- ols y2 0 x
Modelo3 <- ols y3 0 x
Modelo4 <- ols y4 0 x4
\end{verbatim}
}
\end{itemize}

\subsection{Actividad 3 - Discusión}
\label{sec:org36f7834}

\begin{enumerate}
\item Compare los estadísticos de los distintos modelos
\label{sec:org55b87c1}
\begin{itemize}
\item el coeficiente de determinación y en el coeficiente de determinación ajustado
\item la suma de cuadrados de los residuos,
\item la desviación típica de los errores de ajuste (\texttt{D.T. de la regresión}),
\item los estadísticos \testadistico
\item los p-valores.
\end{itemize}

\item A la luz de los estadísticos de las cuatro regresiones ¿Qué modelo es mejor?
\label{sec:org62f084b}
