Practicas/PracticasGretl/Lecc03.org
***** Observe el diagrama de dispersión XY en cada modelo

  - ``pinche'' en */~Ver --> Gráficos --> Gráfico XY (scatter)~/*
    Elija la variable para el eje X (regresor) y la variable Y
    (regresando)

  #+latex: {\vspace{3pt} \color{gray!70!black}
  /o, por ejemplo, teclee en linea de comandos/:
    #+begin_src hansl
gnuplot y1 x
    #+end_src
  /podemos pintar varios diagramas juntos con/:
    #+begin_src hansl
gnuplot y1 y2 y3 x
    #+end_src
  /o varios diagramas separados con/:
    #+NAME: DA-diagramas
    #+begin_src hansl
scatters y1 y2 y3 ; x
scatters y4 ; x4
    #+end_src    
  #+latex: }

    \vspace{-10pt}
  
***** De los cuatro modelos\dots ¿cuáles parecen razonables?


# +LATEX: \clearpage
#+latex: \vspace{16pt}
#+latex: \noindent
*Código completo de la práctica* ~anscombe.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/anscombe.inp}
#+LATEX: \clearpage

** COMMENT Resultado en Gretl

#+begin_src bash :results file :file anscombeOUTPUT.txt :output-dir ~/gretl/resultados 
  gretlcli -b pub/anscombe.inp 
#+end_src

#+RESULTS:
[[file:~/gretl/resultados/anscombeOUTPUT.txt]]



* Los errores de ajuste MCO son perpendiculares a los regresores
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/TextilTheil.inp
   :END:

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/TextilTheil.inp][TextilTheil.inp]] |

***** Carga de datos

Vamos a usar el conjunto de datos de consumo percápita de textiles, de
Henri Theil, Principios de Econometría, Nueva York: Wiley, 1971,
p. 102.  El conjunto de datos consta de 17 observaciones anuales de
series de tiempo para el periodo 1923--1939 del consumo de textiles en
los Países Bajos. Todas las variables son expresadas como índices con
base 100 en 1925.

*/~Archivo --> Abrir datos --> Archivo de muestra~/* y en la pestaña
*/~Gretl~/* seleccione =theil=.

#+latex: {\vspace{3pt} \color{gray!70!black}
/o bien teclee en linea de comandos/:
  #+begin_src hansl
  open theil
  #+end_src  
#+latex: }

***** Ajuste por MCO el modelo
\begin{displaymath}
  \Vect{y}=\Estmc{\beta_1}\Vect{1}+\Estmc{\beta_2}\Vect[2]{X}+\Estmc{\beta_3}\Vect[3]{X}+\res
\end{displaymath}
donde \Vect{y} es el consumo de textiles \Vect[2]{X} la renta y
\Vect[3]{X} los precios relativos: */~Modelo -> Mínimos Cuadrados
Ordinarios~/*; indique ~consume~ como regresando y ~const~, ~income~ y
~relprice~ como regresores. Pulse */~Aceptar~/* (guarde el modelo como
icono).

#+latex: {\vspace{3pt} \color{gray!70!black}
/o bien teclee en linea de comandos/:
  #+begin_src hansl
  AjusteMCO <- ols consume const income relprice
  #+end_src  
#+latex: }

***** Guardado de datos ajustados y de los errores

En la ventana del modelo ajustado: */~Guardar -> Valores estimados~/*
e indique un nombre, por ejemplo ~yhat~. Lo mismo para los errores:
*/~Guardar -> Residuos~/* y como nombre por ejemplo ~ehat~

#+latex: {\vspace{3pt} \color{gray!70!black}
/o bien teclee en linea de comandos/:
  #+begin_src hansl
  series ehat = $uhat
  series yhat = $yhat
  #+end_src  
#+latex: }

***** Verificación de que los residuos son ortogonales a los regresores y al ajuste, pero no al regresando

Compruebe que
\begin{displaymath}
  \media{\res}=0,\quad
  \mediap*{\prodH{\res}{\Vect[2]{x}}}=0,\quad
  \mediap*{\prodH{\res}{\Vect[3]{x}}}=0,\quad
  \mediap*{\prodH{\res}{\VEstmc{y}}} =0\quad\text{pero}\quad
  \mediap*{\prodH{\res}{\Vect{y}}}\ne0.
\end{displaymath}

- En la ventana principal: */~Añadir -> Definir nueva variable~/* y en
  cada caso escribir la formula y pulsar en */~Aceptar~/*
  1) ei = ehat*income
  2) er = ehat*relprice
  3) ey = ehat*yhat
  4) ec = ehat*consume

#+latex: {\vspace{3pt} \color{gray!70!black}
/o bien teclee en linea de comandos/:
  #+begin_src hansl
  series ei = ehat*income
  series er = ehat*relprice
  series ey = ehat*yhat
  series ec = ehat*consume
  #+end_src  
#+latex: }

- Observe los valores medios de los productos, es decir, de ~ehat~,
  ~ei~, ~er~, ~ey~ y ~ec~ marcando las variables haciendo click sobre
  ellas con el botón derecho y eligiendo */~Estadísticos
  principales~/*

#+latex: {\vspace{3pt} \color{gray!70!black}
/o bien teclee en linea de comandos/:
  #+begin_src hansl
  summary --simple ehat ei er ey ec
  #+end_src  
#+latex: }

***** Explique los resultados.


# +LATEX: \clearpage
#+latex: \vspace{16pt}
#+latex: \noindent
*Código completo de la práctica* ~TextilTheil.inp~
#+latex: \vspace{10pt}
\lstinputlisting{scripts/TextilTheil.inp}
#+LATEX: \clearpage


* El coeficiente de determinación como cuadrado de la correlación entre valores observados y ajustados
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/EjPviviendaR2.inp
   :END:

| Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/EjPviviendaR2.inp][EjPviviendaR2.inp]] |

Calcule el coeficiente de determinación $R^2$ para el ejemplo del
precio de las viviendas, pero empleando el coeficiente de correlación
entre los precios y los precios ajustados.  (\textbf{Pista:} calcule
el coeficiente de correlación lineal simple entre \VEstmc{Y} y
\Vect{Y} y elévelo al cuadrado.) Puede hacerlo mediante los menús
desplegables de las ventanas de Gretl, /o bien en linea de comandos/:

#+latex: \vspace{16pt}
#+latex: {\vspace{3pt} \color{gray!70!black}
#+begin_src hansl :exports none
open data3-1
ols price const sqft
genr phat  = $yhat
scalar Coef_detR2 = corr(price,phat)^2
#+end_src
#+latex: }

\lstinputlisting{scripts/EjPviviendaR2.inp}

#+LATEX: \clearpage


