Practicas/PracticasGretl/pub/Lecc03.tex

\item Observe el diagrama de dispersión XY en cada modelo
\label{sec:org86a7b08}

\begin{itemize}
\item ``pinche'' en \textbf{\emph{\texttt{Ver -{}-> Gráficos -{}-> Gráfico XY (scatter)}}}
Elija la variable para el eje X (regresor) y la variable Y
(regresando)
\end{itemize}

{\vspace{3pt} \color{gray!70!black}
\emph{o, por ejemplo, teclee en linea de comandos}:
\begin{verbatim}
gnuplot y1 x
\end{verbatim}
\emph{podemos pintar varios diagramas juntos con}:
\begin{verbatim}
gnuplot y1 y2 y3 x
\end{verbatim}
\emph{o varios diagramas separados con}:
\begin{verbatim}
scatters y1 y2 y3 ; x
scatters y4 ; x4
\end{verbatim}
}

\vspace{-10pt}

\item De los cuatro modelos\dots{} ¿cuáles parecen razonables?
\label{sec:orgabdf6e1}


\vspace{16pt}
\noindent
\textbf{Código completo de la práctica} \texttt{anscombe.inp}
\vspace{10pt}
\lstinputlisting{scripts/anscombe.inp}
\clearpage
\end{enumerate}

\section{Los errores de ajuste MCO son perpendiculares a los regresores}
\label{sec:org891e0ed}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/TextilTheil.inp}{TextilTheil.inp}\\[0pt]
\end{tabular}
\end{center}

\begin{enumerate}
\item Carga de datos
\label{sec:org0cca9e9}

Vamos a usar el conjunto de datos de consumo percápita de textiles, de
Henri Theil, Principios de Econometría, Nueva York: Wiley, 1971,
p. 102.  El conjunto de datos consta de 17 observaciones anuales de
series de tiempo para el periodo 1923--1939 del consumo de textiles en
los Países Bajos. Todas las variables son expresadas como índices con
base 100 en 1925.

\textbf{\emph{\texttt{Archivo -{}-> Abrir datos -{}-> Archivo de muestra}}} y en la pestaña
\textbf{\emph{\texttt{Gretl}}} seleccione \texttt{theil}.

{\vspace{3pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
open theil
\end{verbatim}
}

\item Ajuste por MCO el modelo
\label{sec:org1b863df}
\begin{displaymath}
  \Vect{y}=\Estmc{\beta_1}\Vect{1}+\Estmc{\beta_2}\Vect[2]{X}+\Estmc{\beta_3}\Vect[3]{X}+\res
\end{displaymath}
donde \Vect{y} es el consumo de textiles \Vect[2]{X} la renta y
\Vect[3]{X} los precios relativos: \textbf{\emph{\texttt{Modelo -> Mínimos Cuadrados
Ordinarios}}}; indique \texttt{consume} como regresando y \texttt{const}, \texttt{income} y
\texttt{relprice} como regresores. Pulse \textbf{\emph{\texttt{Aceptar}}} (guarde el modelo como
icono).

{\vspace{3pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
AjusteMCO <- ols consume const income relprice
\end{verbatim}
}

\item Guardado de datos ajustados y de los errores
\label{sec:org971db00}

En la ventana del modelo ajustado: \textbf{\emph{\texttt{Guardar -> Valores estimados}}}
e indique un nombre, por ejemplo \texttt{yhat}. Lo mismo para los errores:
\textbf{\emph{\texttt{Guardar -> Residuos}}} y como nombre por ejemplo \texttt{ehat}

{\vspace{3pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
series ehat = $uhat
series yhat = $yhat
\end{verbatim}
}

\item Verificación de que los residuos son ortogonales a los regresores y al ajuste, pero no al regresando
\label{sec:org03fd488}

Compruebe que
\begin{displaymath}
  \media{\res}=0,\quad
  \mediap*{\prodH{\res}{\Vect[2]{x}}}=0,\quad
  \mediap*{\prodH{\res}{\Vect[3]{x}}}=0,\quad
  \mediap*{\prodH{\res}{\VEstmc{y}}} =0\quad\text{pero}\quad
  \mediap*{\prodH{\res}{\Vect{y}}}\ne0.
\end{displaymath}

\begin{itemize}
\item En la ventana principal: \textbf{\emph{\texttt{Añadir -> Definir nueva variable}}} y en
cada caso escribir la formula y pulsar en \textbf{\emph{\texttt{Aceptar}}}
\begin{enumerate}
\item ei = ehat*income
\item er = ehat*relprice
\item ey = ehat*yhat
\item ec = ehat*consume
\end{enumerate}
\end{itemize}

{\vspace{3pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
series ei = ehat*income
series er = ehat*relprice
series ey = ehat*yhat
series ec = ehat*consume
\end{verbatim}
}

\begin{itemize}
\item Observe los valores medios de los productos, es decir, de \texttt{ehat},
\texttt{ei}, \texttt{er}, \texttt{ey} y \texttt{ec} marcando las variables haciendo click sobre
ellas con el botón derecho y eligiendo \textbf{\emph{\texttt{Estadísticos
  principales}}}
\end{itemize}

{\vspace{3pt} \color{gray!70!black}
\emph{o bien teclee en linea de comandos}:
\begin{verbatim}
summary --simple ehat ei er ey ec
\end{verbatim}
}

\item Explique los resultados.
\label{sec:org55fdf3e}


\vspace{16pt}
\noindent
\textbf{Código completo de la práctica} \texttt{TextilTheil.inp}
\vspace{10pt}
\lstinputlisting{scripts/TextilTheil.inp}
\clearpage
\end{enumerate}


\section{El coeficiente de determinación como cuadrado de la correlación entre valores observados y ajustados}
\label{sec:orge6215fa}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/EjPviviendaR2.inp}{EjPviviendaR2.inp}\\[0pt]
\end{tabular}
\end{center}

Calcule el coeficiente de determinación \(R^2\) para el ejemplo del
precio de las viviendas, pero empleando el coeficiente de correlación
entre los precios y los precios ajustados.  (\textbf{Pista:} calcule
el coeficiente de correlación lineal simple entre \VEstmc{Y} y
\Vect{Y} y elévelo al cuadrado.) Puede hacerlo mediante los menús
desplegables de las ventanas de Gretl, \emph{o bien en linea de comandos}:

\vspace{16pt}
{\vspace{3pt} \color{gray!70!black}
}

\lstinputlisting{scripts/EjPviviendaR2.inp}

\clearpage
