Practicas/PracticasGretl/Lecc03.org
* La importancia a los criterios de ajuste es muy relativa
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/PesoEdad.inp
   :END:

   | Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/PesoEdad.inp][PesoEdad.inp]] |

   - Cargue los datos del ejemplo del peso y edad de ocho niños.
         
     - Puede descargar el fichero =PesoEdad.gdt= del subdirectorio
       =datos= del directorio con el material del curso,
   
     - o introducir los datos manualmente siguiendo */~Archivo ->
       Nuevo conjunto de datos~/*. Indique que hay 8 observaciones de
       sección cruzada, y marque ``empezar a introducir los valores de
       los datos''. Introduzca el nombre de la primera variable y
       luego los datos del peso de cada niño. Pulsando en ~+~ puede
       añadir la segunda variable.
       
   -  Genere la serie de edades al cuadrado y de la de edades al cubo.
   
   -  Ajuste el modelo
     $\VEstmc{peso}=\Estmc{\beta_1}\Vect{1}+\Estmc{\beta_2}\Vect{edad}$
     y añádalo a la tabla de modelos.
   
   
      - Guarde el modelo como icono y pulse sobre su icono con el
        botón derecho. Seleccione */~Añadir a la tabla de modelos~/*
	
         - o bien, tras estimar el modelo teclee ~modeltab add~
   	
   - Ajuste
     $\VEstmc{peso}=\Estmc{\beta_1}\Vect{1}+\Estmc{\beta_2}\Vect{edad}+\Estmc{\beta_3}\Vect[][2]{(edad)}$
     y añádalo a la tabla de modelos.
      
   - Ajuste
     $\VEstmc{peso}=\Estmc{\beta_1}\Vect{1}+\Estmc{\beta_2}\Vect{edad}+\Estmc{\beta_3}\Vect[][2]{(edad)}+\Estmc{\beta_3}\Vect[][3]{(edad)}$
     y añádalo a la tabla de modelos.
        
   - Compare los ajustes: pinchando sobre el icono de =Tabla de
     modelos=; o bien tecleando ~modeltab show~.

   - Genere las figuras de los distintos ajustes.

Fíjese que que en los dos últimos ajustes las potencias de la edad son
regresores, pero que en los tres modelos la única variable
/explicativa/ del peso es la edad (variable explicativa y regresor no
son sinónimos).

El siguiente guión realiza todos los pasos
#+latex: {\vspace{3pt} \color{gray!70!black}
#+begin_src hansl :exports none
open datos/PesoEdad.gdt

series Edad2=Edad^2
series Edad3=Edad^3

Modelo1 <- ols Peso_Kg const Edad
modeltab add
Modelo2 <- ols Peso_Kg const Edad Edad2
modeltab add
Modelo3 <- ols Peso_Kg const Edad Edad2 Edad3
modeltab add
modeltab show   

series yhat1=Modelo1.$yhat
Modelo1 <- gnuplot Peso_Kg yhat1 Edad --with-lp=yhat1 --output="display"
series yhat2=Modelo2.$yhat
Modelo2 <- gnuplot Peso_Kg yhat2 Edad --with-lp=yhat2 --output="display" --fit=quadratic
series yhat3=Modelo3.$yhat
Modelo3 <- gnuplot Peso_Kg yhat3 Edad --with-lp=yhat3 --output="display" --fit=cubic   
#+end_src
#+latex: }

#+LATEX: \vspace{12pt}
\lstinputlisting{scripts/PesoEdad.inp}


#+LATEX: \clearpage


* ¿Tiene sentido llamar variable explicativa a cualquier regresor?
   :PROPERTIES:
   :header-args: :tangle ./pub/scripts/cigfecfr.inp
   :END:

   | Guión: | [[https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/cigfecfr.inp][cigfecfr.inp]] |
   
   /*Una regresión infantil:* exploremos la teoría que ``Dumbo''
      ofrece a los niños sobre la natalidad y las cigüeñas./
   
   ¿Podemos encontrar relación entre la tasa de fecundidad de las
   mujeres francesas (=fec=) y la densidad de cigüeñas (=cig=) en
   Alsacia para el período 1945-1986 (=annee=)? La tasa de fecundidad
   está calculada como número de niños por 10000 mujeres (Indicateur
   conjucturel de fécondité en 2004 par l'INSEE http://www.insee.fr).
   Las cifras de cigüeñas proceden de The Global Population Database:
   NERC Centre for Population Biology
   (\url{http://www3.imperial.ac.uk/cpb/research/patternsandprocesses/gpdd})
   y se trata del número de parejas de cigüeñas que anidan en la
   región de Alsacia.

   - Cargue el conjunto de datos ~cigfecfr.inp~.
     
   - Realice un diagrama de dispersión entre =fec= y =cig= y calcule
     el coeficiente de correlación.

   - Ajuste por MCO la tasa de fecundidad =fec= con la constante y =cig=

   - Realice un gráfico de series temporales de ambas
     variables. Observe que parece haber un retardo entre la aparición
     de las cigüeñas y la variación en la tasa de natalidad.

   - Cree una nueva serie =cig6= que sea la serie =cig= retardada 6
     meses y repita los pasos anteriores. Observe que el ajuste
     mejora.

   - A la luz de los resultados ¿``explica'' el número de parejas de
     cigüeñas casi el 90% de la variabilidad en la natalidad de la
     región de Alsacia en esos años?

El siguiente guión realiza todos los pasos
#+latex: {\vspace{3pt} \color{gray!70!black}
#+begin_src hansl :exports none
open datos/cigfecfr.gdt

Diagrama  <- gnuplot fec cig  --output="display"
scalar rho = corr(fec, cig)
ols fec 0 cig

FecCig <- gnuplot fec cig --time-series --with-lines --output="display" 
series cig6=cig(-6)

Diagrama6 <- gnuplot fec cig6 --output="display"
scalar rho = corr(fec, cig6)
ols fec 0 cig6
#+end_src
#+latex: }

#+LATEX: \vspace{12pt}
\lstinputlisting{scripts/cigfecfr.inp}

     
