Practicas/PracticasGretl/pub/Lecc03.tex


\section{La importancia a los criterios de ajuste es muy relativa}
\label{sec:orge2f9a95}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/PesoEdad.inp}{PesoEdad.inp}\\[0pt]
\end{tabular}
\end{center}

\begin{itemize}
\item Cargue los datos del ejemplo del peso y edad de ocho niños.

\begin{itemize}
\item Puede descargar el fichero \texttt{PesoEdad.gdt} del subdirectorio
\texttt{datos} del directorio con el material del curso,

\item o introducir los datos manualmente siguiendo \textbf{\emph{\texttt{Archivo ->
       Nuevo conjunto de datos}}}. Indique que hay 8 observaciones de
sección cruzada, y marque ``empezar a introducir los valores de
los datos''. Introduzca el nombre de la primera variable y
luego los datos del peso de cada niño. Pulsando en \texttt{+} puede
añadir la segunda variable.
\end{itemize}

\item Genere la serie de edades al cuadrado y de la de edades al cubo.

\item Ajuste el modelo
\(\VEstmc{peso}=\Estmc{\beta_1}\Vect{1}+\Estmc{\beta_2}\Vect{edad}\)
y añádalo a la tabla de modelos.
\end{itemize}


\begin{itemize}
\item Guarde el modelo como icono y pulse sobre su icono con el
botón derecho. Seleccione \textbf{\emph{\texttt{Añadir a la tabla de modelos}}}

\begin{itemize}
\item o bien, tras estimar el modelo teclee \texttt{modeltab add}
\end{itemize}
\end{itemize}
\begin{itemize}
\item Ajuste
\(\VEstmc{peso}=\Estmc{\beta_1}\Vect{1}+\Estmc{\beta_2}\Vect{edad}+\Estmc{\beta_3}\Vect[][2]{(edad)}\)
y añádalo a la tabla de modelos.

\item Ajuste
\(\VEstmc{peso}=\Estmc{\beta_1}\Vect{1}+\Estmc{\beta_2}\Vect{edad}+\Estmc{\beta_3}\Vect[][2]{(edad)}+\Estmc{\beta_3}\Vect[][3]{(edad)}\)
y añádalo a la tabla de modelos.

\item Compare los ajustes: pinchando sobre el icono de \texttt{Tabla de
     modelos}; o bien tecleando \texttt{modeltab show}.

\item Genere las figuras de los distintos ajustes.
\end{itemize}

Fíjese que que en los dos últimos ajustes las potencias de la edad son
regresores, pero que en los tres modelos la única variable
\emph{explicativa} del peso es la edad (variable explicativa y regresor no
son sinónimos).

El siguiente guión realiza todos los pasos
{\vspace{3pt} \color{gray!70!black}
}

\vspace{12pt}
\lstinputlisting{scripts/PesoEdad.inp}


\clearpage


\section{¿Tiene sentido llamar variable explicativa a cualquier regresor?}
\label{sec:org7980e6d}
\begin{center}
\begin{tabular}{ll}
Guión: & \href{https://github.com/mbujosab/Ectr/tree/master/Practicas/Gretl/scripts/cigfecfr.inp}{cigfecfr.inp}\\[0pt]
\end{tabular}
\end{center}

\emph{\textbf{Una regresión infantil:} exploremos la teoría que ``Dumbo''
   ofrece a los niños sobre la natalidad y las cigüeñas.}

¿Podemos encontrar relación entre la tasa de fecundidad de las
mujeres francesas (\texttt{fec}) y la densidad de cigüeñas (\texttt{cig}) en
Alsacia para el período 1945-1986 (\texttt{annee})? La tasa de fecundidad
está calculada como número de niños por 10000 mujeres (Indicateur
conjucturel de fécondité en 2004 par l'INSEE \url{http://www.insee.fr}).
Las cifras de cigüeñas proceden de The Global Population Database:
NERC Centre for Population Biology
(\url{http://www3.imperial.ac.uk/cpb/research/patternsandprocesses/gpdd})
y se trata del número de parejas de cigüeñas que anidan en la
región de Alsacia.

\begin{itemize}
\item Cargue el conjunto de datos \texttt{cigfecfr.inp}.

\item Realice un diagrama de dispersión entre \texttt{fec} y \texttt{cig} y calcule
el coeficiente de correlación.

\item Ajuste por MCO la tasa de fecundidad \texttt{fec} con la constante y \texttt{cig}

\item Realice un gráfico de series temporales de ambas
variables. Observe que parece haber un retardo entre la aparición
de las cigüeñas y la variación en la tasa de natalidad.

\item Cree una nueva serie \texttt{cig6} que sea la serie \texttt{cig} retardada 6
meses y repita los pasos anteriores. Observe que el ajuste
mejora.

\item A la luz de los resultados ¿``explica'' el número de parejas de
cigüeñas casi el 90\% de la variabilidad en la natalidad de la
región de Alsacia en esos años?
\end{itemize}

El siguiente guión realiza todos los pasos
{\vspace{3pt} \color{gray!70!black}
}

\vspace{12pt}
\lstinputlisting{scripts/cigfecfr.inp}
\end{document}